{
  "source": "Iconify",
  "crawled_at": "2026-01-04T19:53:38.104650",
  "version": null,
  "sections": [
    {
      "title": "Iconify Icon web componentâ",
      "url": "https://iconify.design/docs/iconify-icon/",
      "content": "Iconify Icon web component\nâ\nIconify Icon is a web component renders icons.\nUsage\nâ\nIt is designed to be as easy to use as possible.\nhtml\n<\niconify-icon\nicon\n=\n\"mdi:home\"\n>\n</\niconify-icon\n>\nSupported frameworks\nâ\nWeb component can be used in HTML without any UI framework. See usage examples below.\nIt also works great with all modern frameworks that support web components:\nSvelte and SvelteKit/Sapper.\nVue 2 and Vue 3. Require changing config when used in Nuxt (see below).\nLit.\nEmber.\nReact and Next, but with small differences, such as using\nclass\ninstead of\nclassName\n.\nWrapper fixes it\n.\nHowever, some UI frameworks require custom wrappers:\nSolid. See\nIconify icon web component for Solid\n.\nLayout shift\nâ\nWeb component is not rendered instantly. There could be a few milliseconds delay.\nThis is caused by:\nJavaScript. Web component cannot be rendered until it is loaded and registered.\nBecause of web component spec. Rendering is done asynchronously in browser, often causing tiny delay.\nThis might cause layout shift.\nTo avoid layout shift, add this to your CSS:\ncss\niconify-\nicon\n{\nÂ\ndisplay\n: inline-block;\nÂ\nwidth\n:\n1em\n;\nÂ\nheight\n:\n1em\n;\n}\nIcon data on demand\nâ\nInstead of embedding an entire icon, all you need to do is provide an icon name in\nicon\nattribute.\nWeb component will retrieve icon data from\nIconify API\n, then will render SVG in shadow DOM.\nThere are over 275k icons available from many open source icon sets.\nDon't want to rely on third party API servers? You can\nhost your own Iconify API\n. You can also use it with your own icons.\nShadow DOM\nâ\nSVG is rendered in shadow DOM. What does that mean?\nHTML for icon is hidden, not part of the main document.\nIt simplifies hydration when the web component is used in a UI framework with server side rendering. See below.\nStylesheet used in the document does not affect icons, preventing potential conflicts.\nSometimes this can be a disadvantage, for example, if you do want to access icon content to perform CSS or JavaScript based animations. If you do not want a web component that uses shadow DOM, take a look at\nIconify icon components\n.\nSSR hydration\nâ\nOne of the issues a web component solves is a hydration, which is used by many modern UI frameworks.\nServer side rendering is becoming more and more popular, hydration is complex and can easily be broken by a mismatched DOM.\nWhat is hydration? Hydration is a process of matching content generated on server and content generated by UI framework in browser. Instead of re-rendering document, a UI framework uses HTML generated on server. This is the basic explanation. It is actually more complex than that, see various articles on SSR hydration.\nThere are several issues with hydrating icons:\nIcons might have unique IDs in elements, such as masks and clip paths. Using multiple icons on the same page requires using different IDs (or randomising them), which usually breaks hydration process.\nDynamically loaded icon data cannot be rendered before hydration ends. This can be solved by rendering icon only after component has been mounted, but that might cause rendering delays and other issues.\nShadow DOM used by web components solves hydration problems. When a UI framework renders icon on server, it only renders\n<iconify-icon>\nelement. During hydration process, UI framework only checks\n<iconify-icon>\nelement, but not actual icon. This means:\nServer side can generate only\n<\niconify-icon\nicon\n=\n\"mdi:home\"\n>\n</\niconify-icon\n>\n, reducing document size.\nWeb component can load icon data and render it immediately and independent of a UI framework, not waiting for a UI framework to mount the component.\nNo issues with duplicate unique IDs. Each icon has its own document, so no need to change IDs of icon elements.\nFaster hydration. Icons can be complex, not checking icon content means less work for a UI framework.\nUsing shadow DOM to render icon leads to better experience for developers. No need to configure anything, no need to worry about icon data, no need to worry about conflicts. It just works.\nRendering only visible icons\nâ\nAs of version 2.0.0 of the web component, icons are rendered only when visible to the visitor.\nFor long documents with many icons, this improves the performance of pages by a lot.\nAs of version 2.1.0, you can opt out of this behavior by adding\nnoobserver\nattribute to web component's HTML:\nhtml\n<\niconify-icon\nicon\n=\n\"mdi:home\"\nnoobserver\n>\n</\niconify-icon\n>\nWhy not use icon font?\nâ\nShadow DOM used by web component has big advantages over usual SVGs or framework specific components, but what about icon fonts?\nDo not use icon fonts!!!\nIcon fonts are ugly. Browser renders icons using font rendering methods, which causes blurred icon edges and icons lose their sharpness.\nIcons rendered from icon fonts are often hard to align, resulting in misaligned icons.\nBrowsers load huge fonts just to render few icons. This can be solved by using custom icon fonts, but doesn't solve other issues.\nNo colored icons, ",
      "code_blocks": [],
      "subsections": [
        "News",
        "Documentation",
        "Usage",
        "Icons",
        "Libraries",
        "API",
        "Articles / Blog",
        "Usageâ",
        "Supported frameworksâ",
        "Layout shiftâ",
        "Icon data on demandâ",
        "Shadow DOMâ",
        "SSR hydrationâ",
        "Rendering only visible iconsâ",
        "Why not use icon font?â"
      ],
      "category": "iconify-icon"
    },
    {
      "title": "Icons on demandâ",
      "url": "https://iconify.design/docs/icon-components/",
      "content": "Icons on demand\nâ\nIconify ecosystem has a unique feature:\nIconify API\n.\nIt can be used to\nload icon data on demand\nand is used by Iconify icon components.\nSkip to list of available components\nif you want to skip long explanation of how it all works.\nHow does it work?\nâ\nIconify icon components are very easy to use. All developer has to specify is an icon name:\nhtml\n<\niconify-icon\nicon\n=\n\"mdi:home\"\n>\n</\niconify-icon\n>\nUnlike\nregular icon components\n, Iconify icon components do not bundle icon data. They load only data for icons used on currently viewed page at run time.\n<Icon icon=\"mdi:home\" />\n<iconify-icon icon=\"mdi:alert\" />\nDeveloper passes icon name as attribute for\nicon component\n.\nAPI\nIcon Names\nBrowser\nComponent requests data for icons from Iconify API.\nAPI\nIcon Data\nBrowser\nAPI sends data for requested icons.\nAPI hosts thousands of icons, but sends only data for icons that were requested.\n<svg width=\"1em\" height=\"1em\" viewBox=\"0 0 24 24\"\n...\n>\n...\n</svg>\n<iconify-icon icon=\"mdi:alert\">\n#shadow-root\n<svg width=\"1em\" height=\"1em\" viewBox=\"0 0 24 24\"\n...\n>\n...\n</svg></iconify-icon>\nComponent renders SVG using data retrieved from Iconify API.\nAdvantages\nâ\nLoading icon data on demand has its advantages and disadvantages over using\nregular icon components\n.\nAdvantages:\nVery easy to use.\nIf you are using many icons on various pages, bundle size is smaller because icon data is loaded only as needed.\nIt can be used with customisable themes, where a developer doesn't know which icons theme is using.\nSmall HTML. Icons are loaded only in browser, not server side rendered.\nDisadvantages:\nRequires access to Iconify API, making it unusable for offline applications. You can host your own API instance, but it is not trivial.\nIcons might not render instantly. Even though there are multiple layers of caching icon data, there is a few milliseconds delay in rendering.\nComponents\nâ\nThe best option by far is\nWeb component\n. It is usable in HTML with or without UI frameworks.\nAdditionally, there are\ncomponents for UI frameworks\n: React, Vue, Svelte, Ember.\nIn future, only\niconify-icon\nweb component will be supported. Why?\nSVG Framework is an old version of the web component, developed many years ago as an experiment when browser did not support web components. It has no place in modern development.\nFramework-specific components have issue with server side rendering. Web compponent solves those issues.\nWeb component\nâ\nThe best option by far is web component. It is the most modern iteration, works with all UI frameworks and works great with server side rendering.\nUsage is simple:\nhtml\n<\niconify-icon\nicon\n=\n\"mdi:home\"\n>\n</\niconify-icon\n>\nSee\nIconify icon web component documentation\n.\nShadow DOM\nâ\nWeb component renders icon in Shadow DOM, separating it from the main document.\nThat has its advantages and disadvantages over other components.\nAdvantages:\nSeparates icon from main DOM, so main DOM doesn't become bloated.\nNo conflicts with unique ids, which are used in some icons in masks, clip paths, animations and few other elements.\nWorks wonderfully with SSR, much better than UI framework native components: no ID conflicts, render is independent of framework rendering, so it doesn't cause any issues with hydration.\nDisadvantages:\nAccessing icon content, such as changing\nstroke-width\n, is not always possible. Depends on use case.\nCannot render icon without\nwidth\nand\nheight\n, making it impossible to resize icon with those properties. Icon can be resized only with\nfont-size\n.\nIf these disadvantages are unacceptable for your project, use \"SVG framework\" or one of UI framework specific components listed below.\nUI frameworks\nâ\nIconify offers components native to various UI frameworks:\nReact\n(warning: when using with Next.js, wrap it in a client-only component or switch to IconifyIcon web component!)\nVue\nSvelte\nUsage is as any other component:\njsx\n<\nIcon\nicon\n=\n\"mdi:home\"\n/>\nThese components behave differently than the web component:\nTo avoid SSR errors, icons are rendered only after a component is mounted. Otherwise, it breaks hydration.\nIcons can be rendered without\nwidth\nand\nheight\nattributes, making it easy to style in CSS.\nYou should consider using the\niconify-icon\nweb component instead of components mentioned above. Dynamic data loading does not work well with SSR. Web component solves those issues.\nLegacy components\nâ\nIn addition to components listed above, there are several legacy components. They were created a long time ago, but no longer relevant in modern development.\nThese components are no longer updated, but can be used if you really need it:\nVue 2\n(Vue 3 was released a long time ago, no point in supporting the old version)\nEmber\n(Ember framework is outdated)\nSVG Framework\n(the oldest of components, has been replaced by the IconifyIcon web component)",
      "code_blocks": [],
      "subsections": [
        "News",
        "Documentation",
        "Usage",
        "Icons",
        "Libraries",
        "API",
        "Articles / Blog",
        "How does it work?â",
        "Advantagesâ",
        "Componentsâ",
        "Web componentâ",
        "UI frameworksâ"
      ],
      "category": "icon-components"
    },
    {
      "title": "Iconsâ",
      "url": "https://iconify.design/docs/icons/",
      "content": "Icons\nâ\nThere are over 275,000 icons available from more than 200 open source icon sets, which you can use in your projects.\nThis section of Iconify documentation explains:\nWhere to get raw data for icons to use in your projects.\nHow icons are organised.\nHow icons are handled in Iconify (imported, cleaned up, updated).\nThis section is only about icon data, it does not explain how to use icons in your project, for that\nsee different section of documentation\n.\nIcon data\nâ\nHow icons are organised:\nIcons are grouped in icon sets. Each icon set contains icons from the same source.\nIcon sets are exported in easy to use JSON format, which includes icons and extra metadata.\nAll icon sets are stored in one main GitHub repository, also available as NPM packages.\nSee\nhow to get icon data\nfor a list of packages and repositories.\nYou can use that data to create your own components, plugins, generate icons in various formats.\nIconify ecosystem offers\ndifferent components and plugins to render icons\nand\ntools to work with icons\n.\nWhat makes Iconify different?\nâ\nWhat makes Iconify different from other projects that consolidate icons?\nAll icon sets are automatically kept up to date.\nIcons are not just dumped as is, they pass strict validation, cleanup and optimisation process to make sure all icons from all icon sets can be used in the same consistent way.\nIcon data is available in easy to use format, encouraging developers to create their own components that render it.\nSee\nicon clean up and validation process\narticle for more details. It also describes icon naming convention used in Iconify.\nIcon sets\nâ\nIcons in Iconify are organised in icon sets.\nEach icon set has icons from the same author(s) following the same theme.\nSee\nicon set basics\nfor more details.\nIcon sets are automatically kept up to date, checking for updates several times a week.\nCustom icons\nâ\nYou can also use Iconify with custom icons.\nThis allows you to reuse components and plugins from Iconify ecosystem with your icons instead of creating your own.\nSee\nbuilding custom icon sets\nfor details.\nAdd an icon set\nâ\nIf you have created an open source icon set that you want to add to Iconify, please\nfollow this guide\n.",
      "code_blocks": [],
      "subsections": [
        "News",
        "Documentation",
        "Usage",
        "Icons",
        "Libraries",
        "API",
        "Articles / Blog",
        "Icon dataâ",
        "What makes Iconify different?â",
        "Icon setsâ",
        "Custom iconsâ",
        "Add an icon setâ"
      ],
      "category": "icons"
    },
    {
      "title": "Iconify APIâ",
      "url": "https://iconify.design/docs/api/",
      "content": "Iconify API\nâ\nIconify API is an open source hosted (or self-hosted) service for developers.\nWhat is it for?\nAPI provides icon data, which made it possible to create\nIconify icon components\nthat load icons demand.\nAPI\ngenerates SVG\n, which developers can link to in HTML or stylesheet.\nAPI\ngenerates CSS\nto render icons as background or mask images.\nAPI has a search engine for hosted icons, which can be used by icon pickers. Currently used by\nIconify plug-ins\nfor various UI design tools.\nAPI can be used to offer hundreds of thousands of icons in website builders or theme customisers. Host your own API, use API's search engine in custom icon picker to allow users select icons, use icon components in UI to render icons.\nHosting API\nâ\nYou can host your own Iconify API service.\nBy hosting Iconify API yourself you:\nHave full control over servers instead of relying on third party service.\nCan choose which icon sets to host or host your own icon sets.\nSee\nhosting Iconify API\nfor more details.\nAPI is available on:\nGitHub\n- you can customise it before deploying.\nNPM\n- can be embedded in an app without running a full server.\nDocker\n- for quick deployment.\nPublic API\nâ\nIconify project offers public API servers, which host over 275k icons from more than 200 open source icon sets.\nTo improve loading times, API is hosted on multiple servers in different parts of the world. Icons are usually loaded within fraction of a second.\nPublic API is available at\nhttps://api.iconify.design\n.\nIt is a public service, servers are free to use, but please do keep in mind that running those servers is not free. If you are using public API or API software,\nplease consider supporting Iconify\nto help out with infrastructure, development and maintenance costs.\nRedundancy\nâ\nSometimes there are problems with internet connections. It happens. Maybe server has issues, maybe visitor's ISP has issues.\nIn case main API host cannot be reached, Iconify public API has backup host names:\nhttps://api.simplesvg.com\nhttps://api.unisvg.com\nEach of backup host names points to half of API servers. For example, in western Europe there are currently 2 servers: in Frankfurt and in London. Main host points to both, one of backup hosts points to server in Frankfurt, another backup host points to server in London. If server in Frankfurt goes down, users that are using that server can be redirected to server in London using one of backup host names.\nRedundancy built in Iconify icon components accounts for that. It tries to connect to main host first, then, if there was no response in reasonable time (timeout is 0.75 seconds), it attempts to connect to one of backup hosts, then to another backup host. Small delay caused by check only affects first query, all further API queries are sent to host that responded.\nSee\nbuilding redundant API\nfor more details.\nQueries\nâ\nIconify API can be used to render SVG, to retrieve icon data, to browse and search icons.\nFor full list of supported queries, their parameters and API responses see\nIconify API queries documentation\n.\nAPI providers\nâ\nIconify icon components can retrieve icons from multiple API servers.\nThis allows you to run your own API to serve only custom icons, while using public Iconify API to get data for open source icon sets.\nSee\nIconify API providers\nfor details.",
      "code_blocks": [],
      "subsections": [
        "News",
        "Documentation",
        "Usage",
        "Icons",
        "Libraries",
        "API",
        "Articles / Blog",
        "Hosting APIâ",
        "Public APIâ",
        "Redundancyâ",
        "Queriesâ",
        "API providersâ"
      ],
      "category": "api"
    }
  ],
  "summary": {
    "total_sections": 4,
    "total_code_blocks": 0,
    "categories": [
      "icon-components",
      "iconify-icon",
      "icons",
      "api"
    ]
  }
}